app/views/posts/show.html.erb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 3]]
SELECT "tags".* FROM "tags" INNER JOIN "posts_tags" ON "tags"."id" = "posts_tags"."tag_id" WHERE "posts_tags"."post_id" = ?  [["post_id", 3]]
---
		        <p class="card-text"><%= post.body %></p>
		        <% tags = Post.find_by(id: post.id).tags %>