app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
	def index
		@user = current_user
		@posts = Post.all.reverse

INSERT INTO "tags" ("post_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 1], ["body", "buendi"], ["created_at", "2017-10-31 16:34:01.002690"], ["updated_at", "2017-10-31 16:34:01.002690"]]
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Tito1"], ["body", "Humberto arroyo"], ["created_at", "2017-10-30 19:28:27.077325"], ["updated_at", "2017-10-30 19:28:27.077325"]]
SELECT  "tags".* FROM "tags" WHERE "tags"."body" = ? LIMIT 1  [["body", "martes"]]
---
	def create
		@post = Post.new(post_params)
		tags = []

		@post.body.split.each do |word|
			if word[0] == '#' then tags << word end
		end
	  	if @post.save
	  		@post.update(user_id: current_user.id)
	  		tags.each do |tag|
	  			new_tag = Tag.find_by(body: tag[1..-1].downcase)

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 5]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 5]]
---
	def destroy
		Post.find(params[:id]).destroy