app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "humbertoa@pintacomex.mx"]]
---
  def create
  	user = User.find_by(email: params[:sessions][:email])