app/controllers/tags_controller.rb

  def show
  	@tag = Tag.find_by(id: params[:id])
---
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", 2]]